I rolled back, everything else being the same, to 0.3.11 which was my last known working version. No issue there.

```
12:06:46.494 STDOUT tofu: kubernetes_annotations.aws_ack_cw: Refreshing state... [id=apiVersion=v1,kind=ServiceAccount
12:06:56.882 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
12:06:56.882 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
12:06:56.882 STDOUT tofu:   + create
12:06:56.882 STDOUT tofu: OpenTofu will perform the following actions:
12:06:56.882 STDOUT tofu:   # module.eks_blueprints_addons.module.secrets_store_csi_driver.helm_release.this[0] will b
12:06:56.882 STDOUT tofu:   + resource "helm_release" "this" {
12:06:56.882 STDOUT tofu:       + atomic                     = false
12:06:56.882 STDOUT tofu:       + chart                      = "secrets-store-csi-driver"
12:06:56.882 STDOUT tofu:       + cleanup_on_fail            = false
12:06:56.882 STDOUT tofu:       + create_namespace           = false
12:06:56.882 STDOUT tofu:       + dependency_update          = false
12:06:56.882 STDOUT tofu:       + description                = "A Helm chart to install the Secrets Store CSI Driver"
12:06:56.882 STDOUT tofu:       + disable_crd_hooks          = false
12:06:56.882 STDOUT tofu:       + disable_openapi_validation = false
12:06:56.882 STDOUT tofu:       + disable_webhooks           = false
12:06:56.882 STDOUT tofu:       + force_update               = false
12:06:56.882 STDOUT tofu:       + id                         = (known after apply)
12:06:56.882 STDOUT tofu:       + lint                       = false
12:06:56.882 STDOUT tofu:       + manifest                   = (known after apply)
12:06:56.882 STDOUT tofu:       + max_history                = 0
12:06:56.882 STDOUT tofu:       + metadata                   = (known after apply)
12:06:56.882 STDOUT tofu:       + name                       = "secrets-store-csi-driver"
12:06:56.882 STDOUT tofu:       + namespace                  = "kube-system"
12:06:56.882 STDOUT tofu:       + pass_credentials           = false
12:06:56.882 STDOUT tofu:       + recreate_pods              = false
12:06:56.882 STDOUT tofu:       + render_subchart_notes      = true
12:06:56.882 STDOUT tofu:       + replace                    = false
12:06:56.882 STDOUT tofu:       + repository                 = "https://kubernetes-sigs.github.io/secrets-store-csi-dr
12:06:56.882 STDOUT tofu:       + reset_values               = false
12:06:56.882 STDOUT tofu:       + reuse_values               = false
12:06:56.882 STDOUT tofu:       + skip_crds                  = false
12:06:56.882 STDOUT tofu:       + status                     = "deployed"
12:06:56.882 STDOUT tofu:       + timeout                    = 300
12:06:56.882 STDOUT tofu:       + values                     = []
12:06:56.882 STDOUT tofu:       + verify                     = false
12:06:56.882 STDOUT tofu:       + version                    = "1.5.3"
12:06:56.885 STDOUT tofu:       + wait                       = false
12:06:56.885 STDOUT tofu:       + wait_for_jobs              = false
12:06:56.885 STDOUT tofu:       + set {
12:06:56.885 STDOUT tofu:           + name  = "syncSecret.enabled"
12:06:56.885 STDOUT tofu:           + value = "true"
12:06:56.885 STDOUT tofu:         }
12:06:56.885 STDOUT tofu:     }
12:06:56.885 STDOUT tofu:   # module.eks_blueprints_addons.module.secrets_store_csi_driver_provider_aws.helm_release.t
12:06:56.885 STDOUT tofu:   + resource "helm_release" "this" {
12:06:56.885 STDOUT tofu:       + atomic                     = false
12:06:56.885 STDOUT tofu:       + chart                      = "secrets-store-csi-driver-provider-aws"
12:06:56.885 STDOUT tofu:       + cleanup_on_fail            = false
12:06:56.885 STDOUT tofu:       + create_namespace           = false
12:06:56.885 STDOUT tofu:       + dependency_update          = false
12:06:56.885 STDOUT tofu:       + description                = "A Helm chart to install the Secrets Store CSI Driver a
12:06:56.885 STDOUT tofu:       + disable_crd_hooks          = false
12:06:56.885 STDOUT tofu:       + disable_openapi_validation = false
12:06:56.885 STDOUT tofu:       + disable_webhooks           = false
12:06:56.885 STDOUT tofu:       + force_update               = false
12:06:56.885 STDOUT tofu:       + id                         = (known after apply)
12:06:56.885 STDOUT tofu:       + lint                       = false
12:06:56.885 STDOUT tofu:       + manifest                   = (known after apply)
12:06:56.885 STDOUT tofu:       + max_history                = 0
12:06:56.886 STDOUT tofu:       + metadata                   = (known after apply)
12:06:56.886 STDOUT tofu:       + name                       = "secrets-store-csi-driver-provider-aws"
12:06:56.886 STDOUT tofu:       + namespace                  = "kube-system"
12:06:56.886 STDOUT tofu:       + pass_credentials           = false
12:06:56.886 STDOUT tofu:       + recreate_pods              = false
12:06:56.886 STDOUT tofu:       + render_subchart_notes      = true
12:06:56.886 STDOUT tofu:       + replace                    = false
12:06:56.886 STDOUT tofu:       + repository                 = "https://aws.github.io/secrets-store-csi-driver-provider-aws"
12:06:56.886 STDOUT tofu:       + reset_values               = false
12:06:56.886 STDOUT tofu:       + reuse_values               = false
12:06:56.886 STDOUT tofu:       + skip_crds                  = false
12:06:56.886 STDOUT tofu:       + status                     = "deployed"
12:06:56.886 STDOUT tofu:       + timeout                    = 300
12:06:56.886 STDOUT tofu:       + values                     = []
12:06:56.886 STDOUT tofu:       + verify                     = false
12:06:56.886 STDOUT tofu:       + version                    = "0.3.11"
12:06:56.886 STDOUT tofu:       + wait                       = false
12:06:56.886 STDOUT tofu:       + wait_for_jobs              = false
12:06:56.886 STDOUT tofu:     }
12:06:56.886 STDOUT tofu: Plan: 2 to add, 0 to change, 0 to destroy.
12:06:56.886 STDOUT tofu:
12:06:56.886 STDOUT tofu: Do you want to perform these actions in workspace "dev"?
12:06:56.886 STDOUT tofu:   OpenTofu will perform the actions described above.
12:06:56.886 STDOUT tofu:   Only 'yes' will be accepted to approve.
12:06:56.886 STDOUT tofu:   Enter a value:
yes
12:07:02.551 STDOUT tofu: module.eks_blueprints_addons.module.secrets_store_csi_driver_provider_aws.helm_release.this[0]: Creating...
12:07:04.046 STDOUT tofu: module.eks_blueprints_addons.module.secrets_store_csi_driver.helm_release.this[0]: Creating...
12:07:06.630 STDOUT tofu: module.eks_blueprints_addons.module.secrets_store_csi_driver_provider_aws.helm_release.this[0]: Creation complete after 4s [id=secrets-store-csi-driver-provider-aws]
12:07:14.048 STDOUT tofu: module.eks_blueprints_addons.module.secrets_store_csi_driver.helm_release.this[0]: Still creating... [10s elapsed]
12:07:18.503 STDOUT tofu: module.eks_blueprints_addons.module.secrets_store_csi_driver.helm_release.this[0]: Creation complete after 15s [id=secrets-store-csi-driver]
12:07:19.502 STDOUT tofu:
12:07:19.502 STDOUT tofu: Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```